# All Datasets

This notebook contains all merged datasets.

In [ ]:
import pandas as pd

# Load the dataset
flood_water_extent = pd.read_csv(
    "Cleaned_Flood_Water_Extent_Kampala_Addis_2005_2025_km2.csv"
)
Rainfall_mm = pd.read_csv("Cleaned_Rainfall_Data.csv")
Urban_Extent_km2 = pd.read_csv("Cleaned_UrbanExtent_Kampala_Addis.csv")

# Normalize all column names across datasets
flood_water_extent.columns = flood_water_extent.columns.str.lower().str.replace(
    " ", "_"
)

Rainfall_mm.columns = Rainfall_mm.columns.str.lower().str.replace(" ", "_")
Urban_Extent_km2.columns = Urban_Extent_km2.columns.str.lower().str.replace(" ", "_")

In [ ]:
# Merge flood water extent with rainfall data
merged_data = pd.merge(
    flood_water_extent, Rainfall_mm, on=["year", "city"], how="outer"
)

# Merge the result with urban extent data
merged_data = pd.merge(merged_data, Urban_Extent_km2, on=["year", "city"], how="outer")

merged_data = merged_data.sort_values(by=["year", "city"]).reset_index(drop=True)

merged_data.head()

,year,city,flood_water_extent_(km^2),rainfall_mm,urban_area_sqkm
0,2001.0,Addis Ababa,NaN,NaN,193.521207
1,2001.0,Kampala,NaN,NaN,186.064651
2,2002.0,Addis Ababa,NaN,NaN,193.521207
3,2002.0,Kampala,NaN,NaN,189.051243
4,2003.0,Addis Ababa,NaN,NaN,194.019134

In [13]:
# Keep only rows where year is 2005 or later
merged_data = merged_data[merged_data["year"] >= 2005].reset_index(drop=True)

merged_data.head()

,year,city,flood_water_extent_(km^2),rainfall_mm,urban_area_sqkm
0,2005.0,Addis Ababa,0.0,1174.917609,194.268098
1,2005.0,Kampala,0.0,1102.198519,212.943976
2,2006.0,Addis Ababa,0.0,1322.667343,196.259808
3,2006.0,Kampala,0.0,1305.716520,217.174981
4,2007.0,Addis Ababa,0.0,1261.028727,196.757737

In [ ]:
# Saving the cleaned data to a new CSV file
merged_data.to_csv("Merged_Flood_Rainfall_Urban_Extent_2005_2025.csv", index=False)